README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Org bootstrap document</title>
<!-- 2015-02-01 Sun 19:38 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Lars Tveito" />
<meta name="viewport" content="width=device-width, initial-scale=1"/>
<link type="text/css" rel="stylesheet" href="css/bootstrap.min.css" />
<link rel="stylesheet" type="text/css" href="css/style.css" />
</head>
<body>
<div id="content">
<h1 class="title">Org bootstrap document</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">About</a></li>
<li><a href="#sec-2">Usage</a></li>
<li><a href="#sec-3">License</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">About</h2>
<div class="outline-text-2" id="text-1">
<p>
This is a simple scheme for Org mode to generate nice and readable HTML
sites. Here are some examples of sites that uses this scheme (all in
Norwegian):
</p>

<ul class="org-ul">
<li><a href="http://folk.uio.no/larstvei/inf2810/v15/">INF2810 - Gruppelærerenes side</a>
</li>
<li><a href="http://folk.uio.no/larstvei/inf2810/v15/emacs-setup.html">Scheme i Emacs!</a>
</li>
<li><a href="http://folk.uio.no/larstvei/inf2810/v15/veien-til-vakker-scheme.html">Veien Til Vakker Scheme</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Usage</h2>
<div class="outline-text-2" id="text-2">
<p>
The scheme consists of a series of CSS and JavaScript files located in the
<code>css</code> and <code>js</code> directory. To use it, simply include the lines starting
with <code>#+OPTIONS:</code> and <code>#+HTML_HEAD:</code> in the top of this file in an <code>.org</code>
file. It assumes that the <code>.org</code> file is located in a directory like this
repository, containing the <code>css</code> and <code>js</code> directories.
</p>

<p>
If these conditions are met, one should be able to export the <code>.org</code> file
to HTML using the <code>org-html-export-to-html</code> command, accessible by the key
sequence <code>C-c C-e h h</code>.
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">License</h2>
<div class="outline-text-2" id="text-3">
<p>
The MIT License (MIT)
</p>

<p>
Copyright (c) 2015 Lars Tveito
</p>

<p>
Permission is hereby granted, free of charge, to any person obtaining a copy
of this software and associated documentation files (the "Software"), to deal
in the Software without restriction, including without limitation the rights
to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
copies of the Software, and to permit persons to whom the Software is
furnished to do so, subject to the following conditions:
</p>

<p>
The above copyright notice and this permission notice shall be included in all
copies or substantial portions of the Software.
</p>

<p>
THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
SOFTWARE.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Lars Tveito</p>
<p class="date">Created: 2015-02-01 Sun 19:38</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.4.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
